# -*- coding: utf-8 -*-
# join.split.test.py

S.split(символ)	Разбиение строки по разделителю


S.join(список)	Сборка строки из списка с разделителем S

ord(символ)	Символ в его код ASCII
chr(число)	Код ASCII в символ


S.expandtabs([tabsize])	Возвращает копию строки, в которой все символы табуляции заменяются одним или несколькими пробелами, в зависимости от текущего столбца. Если TabSize не указан, размер табуляции полагается равным 8 пробелам

S.partition(шаблон)	Возвращает кортеж, содержащий часть перед первым шаблоном, сам шаблон, и часть после шаблона. Если шаблон не найден, возвращается кортеж, содержащий саму строку, а затем две пустых строки
S.rpartition(sep)	Возвращает кортеж, содержащий часть перед последним шаблоном, сам шаблон, и часть после шаблона. Если шаблон не найден, возвращается кортеж, содержащий две пустых строки, а затем саму строку



S.format(*args, **kwargs)	Форматирование строки

